package Sortirovka;
import java.util.Arrays;

/*	Сортировка Шелла
	Данная сортировка, по своей природе является модифицированной сортировкой методом вставки. О чём я говорю? Давайте по порядку.
	Выбирается шаг, причем к у этого выбора есть много подходов. Слишком подробно разбираться в этом вопросе не будем. Поделим наш
массив пополам и получим некоторое число — это и будет нашим шагом. 
	Итак, если у нас в массиве 9 элементов, то наш шаг будет 9/2 = 4,5.Дробную часть мы отбросим и получим 4, так как индексы
массивов — только целые числа.
	С помощью данного шага мы составим связи для наших групп. Если элемент имеет индекс 0, то индекс следующего элемента в его
группе — 0+4, то есть 4. Третий элемент будет иметь индекс 4+4, четвертый — 8+4, и так далее.
	У второй группы первый элемент будет 1,5,9….
	В третьей и четвертой группе дела будут обстоять точно так же.
	В итоге из массива чисел {6,3,8,8,6,9,4,11,1} мы получим четыре группы:
I — {6,6,1} 
II — {3,9} 
III — {8,4} 
IV — {8,11}
	Свои места в общем массиве они сохраняют, но для нас они помечены как участники одной группы:
{6,3,8,8,6,9,4,11,1}
	Далее внутри этих групп происходит описанная выше сортировка вставками, после которой группы будут иметь вид:
I — {1,6,6} 
II — {3,9} 
III — {4,8} 
IV — {8,11}
	В общем массиве ячейки, занимаемые группами, останутся теми же, но внутри них изменится порядок, согласно порядку групп выше:
{1,3,4,8,6,9,8,11,6}
	Массив стал немного более упорядоченным, не так ли?
	Следующий шаг, будет поделен на 2:	4/2 = 2
	Имеем две группы:
I — {1,4,6,8,6} 
II — {3,8,9,11} 
	B общий массив: {1,3,4,8,6,9,8,11,6}
Проходим по обеим группам алгоритмом сортировки вставкой, и получаем массив:
{1,3,4,8,6,9,6,11,8}
	Сейчас наш массив почти отсортирован. Осталась последняя итерация алгоритма: делим шаг на 2: 2/2 = 1.
Мы получаем группу, весь массив:	{1,3,4,8,6,9,6,11,8}
	По которому проходим алгоритмом сортировки вставкой и получаем:
{1,3,4,6,6,8,8,9,11}	
	На данный момент толком не обоснована эффективность сортировки Шелла, так как в разных ситуациях результаты отличаются. Оценки, 
полученные на основании экспериментов, лежат в интервале от O(N3/2) до O(N7/6). */

public class t04_ShellSort {
	
	public static void sortBySelect(int[] array) {
	       int length = array.length;
	       int step = length / 2;
	       while (step > 0) {
	           for (int numberOfGroup = 0; numberOfGroup < length - step; numberOfGroup++) {// проходим по всем нашим группам
	              int j = numberOfGroup;
	               while (j >= 0 && array[j] > array[j + step]) {//сортировка вставкой внутри группы
	                   int temp = array[j];
	                   array[j] = array[j + step];
	                   array[j + step] = temp;
	                   j--;
	               }
	           }
	           step = step / 2; // уменьшаем наш шаг
	       }
	   }
	
public static void main(String[] args) {
	int[] testArr = new int[]{6, 3, 10, 12, 6, 9, 4, 11, 1};
	sortBySelect(testArr);
    for (int i : testArr)   System.out.print(i + " ->");
	}
}
